zhelezyaka/lev-gen2-stm8s005k6/trunk/ lev-gen2-stm8s005k6/src/LevG2_mainfun.c
/********************************************************************************
* Include																		*
********************************************************************************/
#include "stm8s.h"
#include "Global_config.h"
#include "Module_Driver_Define.h"
#include "Module_Flash_Information.h"
#include "Module_Variable_Define.h"
#include "Module_Var_Bit_Define.h"

/********************************************************************************
* Define																		*
********************************************************************************/

/********************************************************************************
* Extern Function																*
********************************************************************************/


/********************************************************************************
* Extern Variable																*
********************************************************************************/

/********************************************************************************
* Global Variable																*
********************************************************************************/


//////////////////////////////////////////////////////////////////////////////
unsigned int FirstInitial_Func(){
	
	System_clk_setup();
    
    InitMosControl();
	InitLEDDisplay();

//    SetLed_DirectIO_OnOff(LED1, TurnOn);
//    SetLed_DirectIO_OnOff(LED2, TurnOn);
//    SetLed_DirectIO_OnOff(LED3, TurnOn);
//    SetLed_DirectIO_OnOff(LED4, TurnOn);
//    SetLed_DirectIO_OnOff(LED5, TurnOn);

	// Initialize LEDs
	
	//Setup_USI_Slave();
	
      delay_cycles(5);  //about 90us at 4MHz
      delay_cycles(10); //about 132us at 4MHz
      delay_cycles(20); //about 224us at 4MHz
      delay_cycles(30); //about 318us at 4MHz
      delay_cycles(40); //about 410us at 4MHz
      delay_cycles(50); //about 502us at 4MHz
      delay_cycles(100); //about 960us at 4MHz
      delay_cycles(100); //about 960us at 4MHz
      delay_cycles(100); //about 960us at 4MHz
	
	
  return StartUp;
}


unsigned int Startup_Func()
{
  
	//Initialization
	disableInterrupts();  /* disable interrupts */

	
	G_Module_Status = 0;
    G_Auxiliary_Module_Status = 0;
	G_SystemFailureStatus = 0;
    G_LED_Interface_Status1 = 0;
    G_LED_Interface_Status2 = 0;
    G_Device_Interface_Status1 = 0;
    G_Add_Device_Interface_Status = 0;

 
    G_DSG_Current_ADC = 0;
    G_CHG_Current_ADC = 0;
    G_VBAT_ADC = 0;
    G_TH1_ADC = 0;
    G_TH2_ADC = 0;

	
	InitLEDDisplay();
    InitMosControl();
    InitButtonEvent();
    InitInputSignalPin();
  
    delay_cycles(5);
    InitAdapterOutputSignal();
    InitUARTFunction();
    
    /////////////////////////////////
    InitSubPollingProtectionVariables();
    InitADCFunction();
    Set_Interrupt_ADC_Conversion_Finish_Function(ProtectionForPolling); //wait for startAdcConversion()
    
    /////////////////////////////////
    InitTimerPollingVariables();
    InitTimer1Function();
    

    
	enableInterrupts();  /* enable interrupts */
    

    
//    while(1){
//    SetLedPWMFunction(0x1f, TurnOn);
//    
//    unsigned int i,j;
//    unsigned int loop_d = 150;
//    unsigned int ddelay = 100;
//    for(i = 0; i< loop_d; i++){
//        delay_cycles(ddelay);
//    }
//    
//    for(j=0; j< 20; j++){
//        SetLedPWM20Steps(j);
//        for(i = 0; i< loop_d; i++){
//            delay_cycles(ddelay);
//        }
//    }
//    
//    SetLedPWMFunction(0x00, TurnOff);
//    
//        for(i = 0; i< loop_d; i++){
//            delay_cycles(ddelay);
//        }
//    }

    
//unsigned char temp = 0;
//    if(temp == 0){
//        SetLed_DirectIO_OnOff(LED1, TurnOn);
//    }else{
//        SetLed_DirectIO_OnOff(LED1, TurnOff);
//    }
//    temp ^= 0x01;
    
    return NormalMode;
}

unsigned char inverse_led1_flag = 0;
unsigned char inverse_led2_flag = 0;

unsigned int Normal_Func(){
    
    Set_Interrupt_Timer1_Calling_Function(1, TimerCounterForPolling);   //50ms
    Set_Interrupt_Timer1_Calling_Function(2, startAdcConversion);       //50ms
    //startAdcConversion();
    
    
    inverse_led1_flag = 0;
    inverse_led2_flag = 0;
    while(1){
        //wfi();  /* Wait For Interrupt */
        
        if(G_Device_Interface_Status1 & BUTTON_CLICK){
            G_Device_Interface_Status1 &= ~BUTTON_CLICK;
            
            if(inverse_led1_flag == 0){
                SetLedPWMFunction(LED1+LED4+LED5, TurnOn);
                
                //SetLedLightOnFlag(LED1, TurnOn);
            }else{
                SetLedPWMFunction(LED1+LED4+LED5, TurnOff);
                //SetLedLightOnFlag(LED1, TurnOff);
            }
            inverse_led1_flag ^= 0x01;
        }
        
        if(G_Device_Interface_Status1 & BUTTON_LONG_PRESS){
            G_Device_Interface_Status1 &= ~BUTTON_LONG_PRESS;
            
            if(inverse_led2_flag == 0){
                //SetLedLightOnFlag(LED2, TurnOn);
                SetLedSerialTurnOnOff(TurnOn);
            }else{
                //SetLedLightOnFlag(LED2, TurnOff);
                SetLedSerialTurnOnOff(TurnOff);
            }
            inverse_led2_flag ^= 0x01;
        }
        
        
        if(G_Auxiliary_Module_Status & SYS_1_SEC_FLAG){
            G_Auxiliary_Module_Status &= ~SYS_1_SEC_FLAG;
            UART_Send_Word_CRC(G_Var_Array, GVarArraySize, true);
        }
        //SetLedPWMFunction(0x1f, TurnOn);
        //SetLed_DirectIO_OnOff(LED2, TurnOn);
        
//        SetLed_DirectIO_BITs(0xff);
//        //delay 1 sec
//        for(int i = 0; i < 200;i++){
//            delay_cycles(100); //about 960us at 4MHz
//        }
//        SetLed_DirectIO_BITs(0);
//        //delay 1 sec
//        for(int i = 0; i < 200;i++){
//            delay_cycles(100); //about 960us at 4MHz
//        }
        
        wfi();
        
//        delay_cycles(5);  //about 90us at 4MHz
//        delay_cycles(10); //about 132us at 4MHz
//        delay_cycles(20); //about 224us at 4MHz
//        delay_cycles(30); //about 318us at 4MHz
//        delay_cycles(40); //about 410us at 4MHz
//        delay_cycles(50); //about 502us at 4MHz
//        delay_cycles(100); //about 960us at 4MHz
//        delay_cycles(100); //about 960us at 4MHz
//        delay_cycles(100); //about 960us at 4MHz
//        for(int i = 0; i < 10;i++){
//            //delay_cycles(100); //about 960us at 4MHz
//        }        
    }//while(1);   
    return ShutdownMode;
}

unsigned int Shutdown_Func(){
    
    return StartUp;
}
#if 0
unsigned int Normal_Func(){
  //////////////////////////////////////////////////////////////////////////////
  // 2012/05/07 Remove DOC Propection, hsinmo
  //unsigned int DSG_OC_Delay_Count;
  unsigned int CHG_OC_Delay_Count;
  unsigned int _2ND_OV_Delay_Count;
  unsigned int _2ND_UV_Delay_Count;
  unsigned int iTemp1, iTemp2;
  
  //DSG_OC_Delay_Count = 0;
  CHG_OC_Delay_Count = 0;
  _2ND_OV_Delay_Count = 0;
  _2ND_UV_Delay_Count = 0;
  
  setMosFET(MOSFET_CHG, DeviceOn);
  setMosFET(MOSFET_DSG, DeviceOn);


  //Clear Activate Action Flag
  G_Activate_Action_Status = 0;
  G_Activate_Action_Status_Other1  = 0;
  //G_CHG_CV_MODE_Cycle_Count = 0;
  //G_DSG_CHG_OC_Delay_Count = 0;
  
  //Coulomb Counter Start
  G_Activate_Action_Status |= ACCUMULATING_Q_ENABLE;
  
  while(1){

    
    __delay_cycles(3000);  // 3ms ==> 1MHz clock
    StartAdcConversion();
    
